### **1. Import Necessary Modules**

In [1]:
import pandas as pd
from matplotlib import pyplot as plt

### **2. Load Data**

In [2]:
df1 = pd.read_excel("E:\ML\RoadMap\w14_EDA\LargeScaleDataAnalysis\Online Retail.xlsx",dtype={"InvoiceNo":"string","StockCode":"string","Description":"string","Country":"string"})
df1.info()

<>:1: SyntaxWarning: invalid escape sequence '\M'
<>:1: SyntaxWarning: invalid escape sequence '\M'
E:\USER_TEMP\TEMP\ipykernel_18868\2699401577.py:1: SyntaxWarning: invalid escape sequence '\M'
  df1 = pd.read_excel("E:\ML\RoadMap\w14_EDA\LargeScaleDataAnalysis\Online Retail.xlsx",dtype={"InvoiceNo":"string","StockCode":"string","Description":"string","Country":"string"})

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  string
 1   StockCode    541909 non-null  string
 2   Description  540455 non-null  string
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  string
dtypes: datetime64[ns](1), float64(2), int64(1), string(4)
memory usage: 33.1 MB

In [3]:
df1.head(10)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
5,536365,22752,SET 7 BABUSHKA NESTING BOXES,2,2010-12-01 08:26:00,7.65,17850.0,United Kingdom
6,536365,21730,GLASS STAR FROSTED T-LIGHT HOLDER,6,2010-12-01 08:26:00,4.25,17850.0,United Kingdom
7,536366,22633,HAND WARMER UNION JACK,6,2010-12-01 08:28:00,1.85,17850.0,United Kingdom
8,536366,22632,HAND WARMER RED POLKA DOT,6,2010-12-01 08:28:00,1.85,17850.0,United Kingdom
9,536367,84879,ASSORTED COLOUR BIRD ORNAMENT,32,2010-12-01 08:34:00,1.69,13047.0,United Kingdom

### **3. Handle Missing Values**

In [4]:
df1.isnull().sum()

InvoiceNo           0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
Country             0
dtype: int64

##### we deifne a boolean mask that will give us true/false rows.the number of rows in the mask is equal to the rows in the dataframe

In [5]:
mask1 = df1.Description.isnull()
mask1

0         False
1         False
2         False
3         False
4         False
          ...
541904    False
541905    False
541906    False
541907    False
541908    False
Name: Description, Length: 541909, dtype: bool

##### we pass the mask to the df[] it will only show the rows that have True values

In [6]:
df1[mask1]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
622,536414,22139,<NA>,56,2010-12-01 11:52:00,0.0,NaN,United Kingdom
1970,536545,21134,<NA>,1,2010-12-01 14:32:00,0.0,NaN,United Kingdom
1971,536546,22145,<NA>,1,2010-12-01 14:33:00,0.0,NaN,United Kingdom
1972,536547,37509,<NA>,1,2010-12-01 14:33:00,0.0,NaN,United Kingdom
1987,536549,85226A,<NA>,1,2010-12-01 14:34:00,0.0,NaN,United Kingdom
...,...,...,...,...,...,...,...,...
535322,581199,84581,<NA>,-2,2011-12-07 18:26:00,0.0,NaN,United Kingdom
535326,581203,23406,<NA>,15,2011-12-07 18:31:00,0.0,NaN,United Kingdom
535332,581209,21620,<NA>,6,2011-12-07 18:35:00,0.0,NaN,United Kingdom
536981,581234,72817,<NA>,27,2011-12-08 10:33:00,0.0,NaN,United Kingdom
538554,581408,85175,<NA>,20,2011-12-08 14:06:00,0.0,NaN,United Kingdom

In [7]:
# we will be using temp_df1 for the cleaning of Description column moving foward
temp_df1 = df1[mask1][['StockCode','Description']]
temp_df1

       StockCode Description
622        22139        <NA>
1970       21134        <NA>
1971       22145        <NA>
1972       37509        <NA>
1987      85226A        <NA>
...          ...         ...
535322     84581        <NA>
535326     23406        <NA>
535332     21620        <NA>
536981     72817        <NA>
538554     85175        <NA>

[1454 rows x 2 columns]

In [8]:
temp_df1.groupby("StockCode").size()

StockCode
10002           2
10080           1
10123C          1
10123G          1
10134           1
               ..
DCGS0074        1
DOT             1
POST            4
gift_0001_10    1
gift_0001_30    1
Length: 960, dtype: int64

In [9]:
# above the StockCode column is as the index.no we a assigning a new index for the datafram and a new column
temp_df1.groupby("StockCode").size().reset_index(name="NullDescriptionCount").sort_values(by=["NullDescriptionCount"],ascending=False).reset_index(drop=True)

        StockCode  NullDescriptionCount
0           35965                    10
1           23084                    10
2           22084                     9
3           22451                     6
4           23348                     5
..            ...                   ...
955         22453                     1
956         22454                     1
957         22461                     1
958         22467                     1
959  gift_0001_30                     1

[960 rows x 2 columns]

In [10]:
# now we will see what are the valid descriptions available for the most description null having stockCode
df1[df1.StockCode == "35965"]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
2889,536592,35965,FOLKART HEART NAPKIN RINGS,4,2010-12-01 17:06:00,3.36,NaN,United Kingdom
6017,536876,35965,FOLKART HEART NAPKIN RINGS,1,2010-12-03 11:36:00,3.36,NaN,United Kingdom
7205,537013,35965,<NA>,-25,2010-12-03 15:40:00,0.00,NaN,United Kingdom
8071,537126,35965,FOLKART HEART NAPKIN RINGS,1,2010-12-05 12:13:00,2.95,18118.0,United Kingdom
10678,537237,35965,FOLKART HEART NAPKIN RINGS,3,2010-12-06 09:58:00,3.36,NaN,United Kingdom
...,...,...,...,...,...,...,...,...
347758,567337,35965,<NA>,5,2011-09-19 14:56:00,0.00,NaN,United Kingdom
349563,567507,35965,FOLKART HEART NAPKIN RINGS,12,2011-09-20 14:46:00,0.97,NaN,United Kingdom
454169,575513,35965,<NA>,7,2011-11-10 10:39:00,0.00,NaN,United Kingdom
464522,576110,35965,<NA>,5,2011-11-14 10:33:00,0.00,NaN,United Kingdom
471033,576618,35965,FOLKART HEART NAPKIN RINGS,12,2011-11-15 17:00:00,0.55,NaN,United Kingdom

In [11]:
# similarly we will check for the second most null description having stock code, if there are valid descriptions left
df1[df1.StockCode=="23084"]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
183218,552654,23084,RABBIT NIGHT LIGHT,2,2011-05-10 14:20:00,2.08,15756.0,United Kingdom
184972,552724,23084,RABBIT NIGHT LIGHT,6,2011-05-11 10:29:00,2.08,13418.0,United Kingdom
185355,552811,23084,RABBIT NIGHT LIGHT,24,2011-05-11 12:43:00,1.79,17677.0,United Kingdom
185404,552816,23084,RABBIT NIGHT LIGHT,1,2011-05-11 12:47:00,2.08,15521.0,United Kingdom
185606,552822,23084,RABBIT NIGHT LIGHT,30,2011-05-11 12:59:00,1.79,15521.0,United Kingdom
...,...,...,...,...,...,...,...,...
541250,581496,23084,RABBIT NIGHT LIGHT,18,2011-12-09 10:20:00,2.08,16558.0,United Kingdom
541304,581497,23084,RABBIT NIGHT LIGHT,37,2011-12-09 10:23:00,4.96,NaN,United Kingdom
541630,581538,23084,RABBIT NIGHT LIGHT,2,2011-12-09 11:34:00,2.08,14446.0,United Kingdom
541824,581579,23084,RABBIT NIGHT LIGHT,24,2011-12-09 12:19:00,1.79,17581.0,United Kingdom
541874,581585,23084,RABBIT NIGHT LIGHT,12,2011-12-09 12:31:00,2.08,15804.0,United Kingdom

In [12]:
# now we are going to replace the NA values of description with most occuring valid descrition value for a specific StockCode
# first we will create a data frame called most_freq. it will have have the most occuring Description value for each stockCode
#then we will do a leftmerge on df1 with the most_freq

most_freq = df1[["StockCode","Description"]].value_counts().reset_index()
most_freq

     StockCode                         Description  count
0       85123A  WHITE HANGING HEART T-LIGHT HOLDER   2302
1        22423            REGENCY CAKESTAND 3 TIER   2200
2       85099B             JUMBO BAG RED RETROSPOT   2159
3        47566                       PARTY BUNTING   1727
4        20725             LUNCH BAG RED RETROSPOT   1638
...        ...                                 ...    ...
4787     35954                             counted      1
4788     35954                               check      1
4789     35923                               check      1
4790    35915C                             damaged      1
4791         m                              Manual      1

[4792 rows x 3 columns]